cases/cavity_Re100_por08_Klinear/0_org/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    movingWall
    {
        type            zeroGradient;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    fixedWalls
    {
        type            zeroGradient;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    front
    {
            type            cyclic;
    }
    back
    {
            type            cyclic;
    }
}

// ************************************************************************* //
