cases/cavity_Re100_por08_Klinear/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu   nu [ 0 2 -1 0 0 0 0 ] 1e-05;


//******  POROUS CHARACTERISTICS  *******************************************//

LenRef	LenRef [ 0 1 0 0 0 0 0 ] 0.02;

porosity porosity [0 0 0 0 0 0 0] 0.8;

Itf  Itf [0 1 0 0 0 0 0] 0.33;

K_input  K_input [ 0 0 0 0 0 0 0 ] (37.73 17.76 37.73);

k_update 0;

gravity   gravity [ 0 1 -2 0 0 0 0 ] (0 0 0);

// ************************************************************************* //
