cases/cavity_Re100_por08_Klinear/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.08 0)
    (0 0.08 0)

    (0 0 0.3)
    (1 0 0.3)
    (1 0.08 0.3)
    (0 0.08 0.3)

    (0 0 1)
    (1 0 1)
    (1 0.08 1)
    (0 0.08 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 4 30) simpleGrading (1 1 0.1)
    hex (4 5 6 7 8 9 10 11) (50 4 70) simpleGrading (1 1 10)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
		(8 9 10 11)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 7 11 8)
            (5 6 10 9)
        );
    }
	back
	{
	     	type cyclic;
	       	neighbourPatch  front;

		faces
		(
            (3 7 6 2)
            (7 11 10 6)
		);
	}
	front
	{
		 	type cyclic;
		   	neighbourPatch  back;

		    faces
		    (
            (1 5 4 0)
            (4 5 9 8)
		    );
	}
   
);

mergePatchPairs
(
);

// ************************************************************************* //
